
# Задача 36: Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6), которая принимает в 
# качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца. Аргументы num_rows и num_columns 
# указывают число строк и столбцов таблицы, которые должны быть распечатаны. Нумерация строк и столбцов идет с 
# единицы (подумайте, почему не с нуля <Операция деление на 0 выдаст ошибку>). Примечание: бинарной операцией называется любая операция, у которой ровно 
# два аргумента, как, например, у операции умножения. 

def print_operation_table(operation, num_rows=8, num_columns=6):
    # Пройдемся по каждой строке
    for i in range(1, num_rows + 1):
        # Создаем пустой список для хранения элементов строки
        row_elements = []
        # Пройдемся по каждому столбцу в текущей строке
        for j in range(1, num_columns + 1):
            # Вычисляем элемент с использованием операции и добавляем его в список
            result = operation(i, j)
            row_elements.append(result)
        # Преобразуем элементы в строку и печатаем
        print(" ".join(map(str, row_elements)))

# Пример использования с операцией умножения
print_operation_table(lambda x, y: x / y)
