
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

n = int(input("Введите количество элементов первого множества: "))
m = int(input("Введите количество элементов второго множества: "))

set1 = set(int(input(f"Введите элемент множества 1 ({i+1}/{n}): ")) for i in range(n))
set2 = set(int(input(f"Введите элемент множества 2 ({i+1}/{m}): ")) for i in range(m))

print("set1:", set1)
print("set2:", set2)

try:
    intersection = sorted(set1.intersection(set2))
    print(*intersection, sep="\n")
except ValueError:
    print("Произошла ошибка: одно или оба множества пусты.")
except Exception as e:
    print("Произошла неизвестная ошибка:", e)

