
# В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — 
# на i-ом кусте выросло a[i] ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста 
# и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном списке урожайности грядки.

# Ввод данных от пользователя
n = int(input("Введите количество кустов черники: "))
bushes = {}
for i in range(n):
    bush_num, berries = map(int, input(f"Введите номер куста {i+1} и через пробел количество ягод: ").split())
    bushes[bush_num] = berries

# Начальное значение максимального количества собранных ягод
max_berries = 0

# Перебор каждого куста и вычисление максимального сбора
for bush_num, berries in bushes.items():
    # Проверяем соседний куст справа
    right_bush = bushes.get(bush_num + 1, 0)
    # Проверяем соседний куст слева
    left_bush = bushes.get(bush_num - 1, 0)
    
    # Суммируем ягоды с текущего куста и его соседей
    total_berries = berries + right_bush + left_bush
    
    # Обновляем максимальное количество собранных ягод, если текущее значение больше
    if total_berries > max_berries:
        max_berries = total_berries

# Выводим результат
print("Максимальное количество ягод, которое можно собрать за один заход:", max_berries)



